package resource.query;

public class TestWords {
	
	static final String[] querynames = new String[]{
			"孙焕泉",
			"席秀海",
			"杨昌江",
			"赵金洲",
			"李中树",
			"张煜",
			"张善文",
			"宋振国",
			"许卫华",
			"毕义泉",
			"张洪山",
			"局领导",
			"管理局局长",
			"管理局副局长",
			"局党委书记",
			"局党委副书记",
			"分公司总经理",
			"分公司副总经理",
			"局经理办公室",
			"局经理办",
			"政策研究室",
			"勘探处",
			"开发处",
			"采油工程处",
			"采油处",
			"生产管理处",
			"生产处",
			"基建处",
			"设备管理处",
			"设备处",
			"技术发展处",
			"规划计划部",
			"规划部",
			"计划部",
			"财务资产处",
			"财务处",
			"资产处",
			"人力资源处",
			"人事处",
			"经营管理部",
			"法律事务处",
			"法务处",
			"审计处",
			"纪委监察处",
			"监察处",
			"安全环保处",
			"安保处",
			"质量技术监督处",
			"质量监督处",
			"油地工作处",
			"局党委办公室",
			"局党委办",
			"党委组织部",
			"党委统战部",
			"局团委",
			"企业文化处",
			"文化处",
			"局工会",
			"社会治安综合治理办公室",
			"局综合治理办",
			"机关党委",
			"卫生管理中心",
			"公共事业管理部",
			"公共事业部",
			"劳动就业服务中心",
			"劳动就业中心",
			"社会保险管理中心",
			"社保中心",
			"离退休职工管理中心",
			"勘探项目管理部",
			"勘探项目部",
			"西部勘探项目部",
			"西部项目部",
			"新疆勘探项目管理部",
			"新疆项目部",
			"勘探开发监督管理部",
			"监理部",
			"销售事业部",
			"局信息中心",
			"财务监控中心",
			"审计中心",
			"定额价格管理中心",
			"油区稽查支队",
			"科技展览中心",
			"局文工团",
			"文联工作办公室",
			"局文联"
	};
	
	public static boolean testwords(String content){
		boolean flag = false;
		for(int i=0;i<TestWords.querynames.length;i++){
			if(content.contains(TestWords.querynames[i])){
				System.out.println("contains:" + TestWords.querynames[i]);
				flag = true;
			}
		}
		return flag;
	}
	public static void main(String[] args){
		String test = "近期，东辛采油厂工艺所机采室的科技人员对新研制的用于稠油开发的井下搅拌器工作原理与工艺实施的可行性进行了认真细致的讨论，认为井下搅拌器可使加入井中的化学降粘剂与原油充分混合，大大降低井内原油粘度，减少进泵阻力，提高泵效，降粘效果非常理想，且生产成本比热采、电加热和化学吞吐等开采工艺有大幅下降，是一种低成本、高效率、实用的开采稠油的理想工具。在油田开发过程中，稠油所占比重越来越大，目前针对稠油区块的开发已成为各油田稳产增产的主要阵地。由于稠油的特点是密度大、粘度高、胶质沥青质含量多、流动性差、泵效低等，给稠油开采带来很大难度。对于特稠油开发采用蒸汽吞吐工艺；一般稠油开采采用电热杆加热降粘工艺或化学药剂降粘吞吐工艺，这些工艺因开采成本高，占井周期长而无法形成规模。为降低开采成本大都采用井口加降粘剂的方法，即从井口往井内油、套环形空间中灌注降粘剂或滴加降粘剂，这种方法虽然降低了生产成本，但由于加入的降粘剂飘浮在原油动液面以上，无法到达抽油泵吸入口，根本起不到降粘的作用，效果不理想。井下搅拌器利用以前空心抽油杆过泵加热降粘技术原理，在其最下端连接搅拌器；通过空心抽油杆带动搅拌器的空心螺杆来驱动叶轮作快速旋转运动，使从地面经过空心抽油杆及空心螺杆泵入到抽油泵下面的化学降粘剂与原油混合后并得到充分搅拌，大大降低了井内原油粘度，原油粘度从10000毫帕秒可以降到150—300毫帕秒，减少进泵阻力，提高泵效，降粘效果非常理想，而且生产成本比热采、电加热和化学吞吐等开采工艺有大幅下降，经济效益和社会效益非常显著。    根据井下搅拌器的选井条件，东辛厂将在部分井上进行试验应用，化验分析降粘效果，并根据应用效果进行推广。";
		
		
		/*for(int i=0;i<querynames.length;i++){
			if(test.contains(querynames[i])){
				System.out.println("contains:" + querynames[i]);
			}
		}*/
	}
}
